tests/performance/captcha-generation.yml
config:
  target: '{{ $processEnvironment.API_BASE_URL || "http://localhost:3000" }}'
  phases:
    - duration: 60
      arrivalRate: 10
      name: "Warm up phase"
    - duration: 120
      arrivalRate: 50
      name: "Sustained load"
    - duration: 60
      arrivalRate: 100
      name: "Peak load"
    - duration: 30
      arrivalRate: 200
      name: "Stress test"
  defaults:
    headers:
      User-Agent: "Artillery-Performance-Test/1.0"
      X-Forwarded-For: "192.168.1.100"
  processor: "./captcha-processor.js"

scenarios:
  - name: "CAPTCHA Generation Performance Test"
    weight: 100
    flow:
      - get:
          url: "/api/v1/captcha/generate"
          capture:
            - header: "x-captcha-session"
              as: "sessionId"
      - think: 1
      - log: "Generated CAPTCHA session: {{ sessionId }}"
      - function: "recordResponseTime"